# Temporary Graphics Manager Set Tooltip Method

Source: https://www.revitapidocs.com/2026/a154f11d-be30-c4ad-0a6d-1d6cb1bff1c1.htm

---

| Temporary Graphics Manager Set Tooltip Method |
| --- |

Sets the tooltip for the temporary graphics object.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetTooltip(
	int index,
	string tooltip
)
```

```
Public Sub SetTooltip (
	index As Integer,
	tooltip As String
)
```

```
public:
void SetTooltip(
	int index,
	String^ tooltip
)
```

```
member SetTooltip :
        index : int *
        tooltip : string -> unit
```

#### Parameters

index Int32
:   Unique index of the temporary graphics object to be updated.

tooltip String
:   Tooltip to be set.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

TemporaryGraphicsManager Class Autodesk.Revit.DB Namespace